openFoamMesh/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $velocity;

boundaryField
{
    inlet
    {
        type    fixedValue;
        value   $internalField;
    }

    outlet
    {
        type    zeroGradient;
    }

//    inlet
//    {
//        type            freestreamVelocity;
//        freestreamValue $internalField;
//    }
//
//    outlet
//    {
//        type            freestreamVelocity;
//        freestreamValue $internalField;
//    }

    wing
    {
        type  fixedValue;
        value uniform (0 0 0);
    }

    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
