openFoamMesh/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type    zeroGradient;
    }

    outlet
    {
        type    fixedValue;
        value   $internalField;
    }

//    inlet
//    {
//        type            freestreamPressure;
//        freestreamValue $internalField;
//    }
//
//    outlet
//    {
//        type            freestreamPressure;
//        freestreamValue $internalField;
//    }

    wing
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type empty;
    }
}


// ************************************************************************* //
