openFoamMesh/system/FODir/FOCourantNo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Co1
{
    type                CourantNo;
    libs                (fieldFunctionObjects);
    executeControl      writeTime;
    executeInterval     1;
    writeControl        writeTime;
    writeInterval       1;
    log			        false;
}

//CourantNo1
//{
//    // Mandatory entries
//    type            CourantNo;
//    libs            (fieldFunctionObjects);
//
//    // Optional entries
//    rho             rho;
//
//    // Optional (inherited) entries
//    field           phi;
//    result          CourantNumberField;
//    region          region0;
//    enabled         true;
//    log             true;
//    timeStart       0;
//    timeEnd         1e-3;
//    executeControl  writeTime;
//    executeInterval 1;
//    writeControl    writeTime;
//    writeInterval   1;
//}


// ************************************************************************* //

