openFoamMesh/system/FODir/FOcontinuityError
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

continuityError
{
    type                continuityError;
    libs                (fieldFunctionObjects);
    executeControl      timeStep;
    executeInterval     1;
    writeControl        writeTime;
    writeInterval       1;
    log			        true;
}

// ************************************************************************* //
