openFoamMesh/system/FODir/FOenergySpectrum
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

energySpectrum
{
    type            energySpectrum;
    libs            (randomProcessesFunctionObjects);
    writeControl    writeTime;
}

// ************************************************************************* //
