openFoamMesh/system/FODir/FOforceCoeff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs_wing
{
    type                forceCoeffs;
    libs                (forces);
    executeControl		timeStep;
    executeInterval	    1;
    writeControl        timeStep;
    writeInterval       1;
    patches             (wing);
    pName               p;
    UName               U;
    rho                 rhoInf;
    rhoInf              1;
    CofR                (0  0   0);
	dragDir (+ 0.939692 0 + 0.342020); // Re=1e6, AOA=16deg
	pitchAxis           (0  1   0); // Re=1e6, AOA=08deg
	liftDir (- 0.342020 0 + 0.939692); // Re=1e6, AOA=16deg
    magUInf             10;
    lRef                1.0;
    Aref                1.0;
    log                 false;
}

//    forces
//    {
//        type                forces;
//        libs                (fieldFunctionObjects);
//        executeControl      timeStep;
//        executeInterval     1;
//        writeControl        writeTime;
//        writeInterval       1;
//        log			        false;
//    }
//
//    forces
//    {
//        type                forces;
//        libs                (forces);
//        executeControl		timeStep;
//        executeInterval	    1;
//        writeControl        timeStep;
//        writeInterval       1;
//        patches             (wing);
//        pName               p;
//        UName               U;
//        rho                 rhoInf;
//        rhoInf              1;
//        CofR                (0  0   0);
//        liftDir             (0  0   1);
//        dragDir             (1  0   0);
//        pitchAxis           (0  1   0);
//        magUInf             80;
//        lRef                4.4640;
//        Aref                1;
//        log                 false;
//    }
//
//    forces_wing
//	{
//        type			    surfaceFieldValue;
//        libs                (fieldFunctionObjects);
//        executeControl		timeStep;
//        executeInterval	    1;
//        writeControl		writeTime;
//        writeInterval		1;
//        writeFields	 	    true;
//        operation           none;
//        surfaceFormat		raw;
//        regionType		    patch;
//        name			    wing;
//        fields			    (forces);		
//        log			        true;
//    }
//

// ************************************************************************* //
