openFoamMesh/system/FODir/FOplanes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Sample velocity in planes
velocityPlanes
{
    type                surfaces;
    libs                (sampling);
    writeControl        writeTime;
    interpolationScheme cellPoint;
    surfaceFormat       vtk;
    formatOptions
    {
        vtk
        {
            legacy true;
            format ascii;
        } 
    }
    fields
    (
        U
    );
    surfaces
    {
        midPlane
        {
            type                plane;
            planeType           pointAndNormal;
            pointAndNormalDict
            {
                normal          (0 1 0);
                point           (0 0.701 0);
            }
        }

        backPlane
        {
            type                plane;
            planeType           pointAndNormal;
            pointAndNormalDict
            {
                normal          (1 0 0);
                point           (2.52 0.701 0);
            }
        }
    }
}

// ************************************************************************* //
