openFoamMesh/system/FODir/FOpressure
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Store pressure distribution at wing surface
pressure_wing
{
    type			    surfaceFieldValue;
    libs                (fieldFunctionObjects);
    executeControl		timeStep;
    executeInterval	    1;
    writeControl		writeTime;
    writeInterval		1;
    writeFields	 	    true;
    operation           none;
    surfaceFormat		raw;
    regionType		    patch;
    name			    wing;
    fields			    (p);		
    log			        false;
}

// ************************************************************************* //
