openFoamMesh/system/FODir/FOsolverInfo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

solverInfo1
{
    // Mandatory entries
    type            solverInfo;
    libs            (utilityFunctionObjects);
    fields          (p);
    writeResidualFields    true;
    writePrecision   16;
    writeToFile      true;
    useUserTime      true;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  writeTime;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   1;
}

// ************************************************************************* //
