openFoamMesh/system/FODir/FOtemplate
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

//    // Compute secondary variables (wall shear stresses, yPlus)
//    wallShearStress
//    {
//        type			    wallShearStress;
//        libs			    (fieldFunctionObjects); //("libfieldFunctionObjects.so");
//        executeControl		timeStep;
//        executeInterval		1;
//        writeControl		writeTime;
//        writeInterval		1;
//        log			        false;
//    }
//
//    forces
//    {
//        type                forces;
//        libs                (fieldFunctionObjects);
//        executeControl      timeStep;
//        executeInterval     1;
//        writeControl        writeTime;
//        writeInterval       1;
//        log			        false;
//    }
//
//
//    // Store wing surface distributions (surfaceFieldValue)
//    pressure_wing
//    {
//        type			    surfaceFieldValue;
//        libs                (fieldFunctionObjects);
//        executeControl		timeStep;
//        executeInterval	    1;
//        writeControl		writeTime;
//        writeInterval		1;
//        writeFields	 	    true;
//        operation           none;
//        surfaceFormat		raw;
//        regionType		    patch;
//        name			    wing;
//        fields			    (p);		
//        log			        false;
//    }
//
//    wallShearStress_wing
//	{
//        type			    surfaceFieldValue;
//        libs                (fieldFunctionObjects);
//        executeControl		timeStep;
//        executeInterval	    1;
//        writeControl		writeTime;
//        writeInterval		1;
//        writeFields	 	    true;
//        operation           none;
//        surfaceFormat		raw;
//        regionType		    patch;
//        name			    wing;
//        fields			    (wallShearStress);		
//        log			        false;
//    }
//
//    // Compute forces, wing surface force distributions, and time series of force coefficients
//    forces
//    {
//        type                forces;
//        libs                (forces);
//        executeControl		timeStep;
//        executeInterval	    1;
//        writeControl        timeStep;
//        writeInterval       1;
//        patches             (wing);
//        pName               p;
//        UName               U;
//        rho                 rhoInf;
//        rhoInf              1;
//        CofR                (0  0   0);
//        liftDir             (0  0   1);
//        dragDir             (1  0   0);
//        pitchAxis           (0  1   0);
//        magUInf             80;
//        lRef                4.4640;
//        Aref                1;
//        log                 false;
//    }
//
//    forces_wing
//	{
//        type			    surfaceFieldValue;
//        libs                (fieldFunctionObjects);
//        executeControl		timeStep;
//        executeInterval	    1;
//        writeControl		writeTime;
//        writeInterval		1;
//        writeFields	 	    true;
//        operation           none;
//        surfaceFormat		raw;
//        regionType		    patch;
//        name			    wing;
//        fields			    (forces);		
//        log			        true;
//    }
//
//    forceCoeffs_wing
//    {
//        type                forceCoeffs;
//        libs                (forces);
//        executeControl		timeStep;
//        executeInterval	    1;
//        writeControl        timeStep;
//        writeInterval       1;
//        patches             (wing);
//        pName               p;
//        UName               U;
//        rho                 rhoInf;
//        rhoInf              1;
//        CofR                (0  0   0);
//        liftDir             (0  0   1);
//        dragDir             (1  0   0);
//        pitchAxis           (0  1   0);
//        magUInf             80;
//        lRef                4.4640;
//        Aref                1;
//        log                 false;
//    }
//
//
//
//    fieldAverage1
//    {
//        type            fieldAverage;
//        libs            (fieldFunctionObjects);
//        writeControl    writeTime;
//
//        fields
//        (
//            U
//            {
//                mean        on;
//                prime2Mean  on;
//                base        time;
//            }
//
//            p
//            {
//                mean        on;
//                prime2Mean  on;
//                base        time;
//            }
//        );
//    }
//
//    // Sample near-wall velocity
//    surfaceSampling
//    {
//        type            surfaces;
//        libs            (sampling);
//        writeControl    onEnd;
//        interpolationScheme cellPoint;
//        surfaceFormat vtk;
//
//        // Fields to be sampled
//        fields
//        (
//            U
//        );
//
//        surfaces
//        {
//            midPlane
//            {
//                type                plane;
//                planeType           pointAndNormal;
//                pointAndNormalDict
//                {
//                    normal          (0 1 0);
//                    point           (0 0.701 0);
//                }
//            }
//
//            backPlane
//            {
//                type                plane;
//                planeType           pointAndNormal;
//                pointAndNormalDict
//                {
//                    normal          (1 0 0);
//                    point           (2.52 0.701 0);
//                }
//            }
//        }
//    }
//
//}

// ************************************************************************* //
