openFoamMesh/system/FODir/FOyPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

yPlus
{
    type                yPlus;
    libs                (fieldFunctionObjects);
    executeControl      writeTime;
    executeInterval     1;
    writeControl        writeTime;
    writeInterval       1;
    log			        false;
}

yPlus_wing
{
    type			    surfaceFieldValue;
    libs                (fieldFunctionObjects);
    executeControl		writeTime;
    executeInterval	    1;
    writeControl		writeTime;
    writeInterval		1;
    writeFields	 	    true;
    operation           none;
    surfaceFormat		raw;
    regionType		    patch;
    name			    wing;
    fields			    (yPlus);		
    log			        false;
}

// ************************************************************************* //
